Autodesk.Revit.DB.Category.IsVisibleInUI
Identifies if the category is visible to the user and should be displayed in UI.
True if the category should be displayed in UI.
Since:
2020

Autodesk.Revit.DB.Category.BuiltInCategory
Gets the BuiltInCategory value for this category.
BuiltInCategory value for the category or INVALID
if the category is not a built-in category.
Since:
2023

Autodesk.Revit.DB.Category.IsBuiltInCategory(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a built-in category.
Remarks:
A ForgeTypeId identifies a built-in category if it corresponds to a valid
BuiltInCategory value according to
Category.IsBuiltInCategoryValid(BuiltInCategory) and
Category.GetBuiltInCategoryTypeId(BuiltInCategory).
categoryTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a built-in category, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Category.GetBuiltInCategory(Autodesk.Revit.DB.ForgeTypeId)
Gets the BuiltInCategory value corresponding to the given built-in category identifier.
Remarks:
A ForgeTypeId identifies a built-in category if it corresponds to a valid
BuiltInCategory value according to
Category.IsBuiltInCategory(ForgeTypeId) and
Category.GetBuiltInCategoryTypeId(BuiltInCategory).
categoryTypeId:
The built-in category identifier.
Returns:
The BuiltInCategory value corresponding to the given built-in category identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryTypeId is not a built-in category identifier. See Category.IsBuiltInCategory(ForgeTypeId) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Category.GetBuiltInCategoryTypeId(Autodesk.Revit.DB.BuiltInCategory)
Gets the ForgeTypeId identifying the given built-in category.
Remarks:
The given BuiltInCategory value must be valid according to
Category.IsBuiltInCategoryValid(BuiltInCategory).
categoryId:
The built-in category.
Returns:
The identifier of the given built-in category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId is not a valid built-in category. See Category.IsBuiltInCategoryValid(BuiltInCategory).
Since:
2022

Autodesk.Revit.DB.Category.IsBuiltInCategoryValid(Autodesk.Revit.DB.BuiltInCategory)
Checks if a Category exists for a given BuiltInCategory.
builtInCategory:  The BuiltInCategory to check.
Remarks:  Some BuiltInCategory values are obsolete and are kept for upgrade reasons. For those no Category exists.
Since:  2020

Autodesk.Revit.DB.Category.GetCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.BuiltInCategory)
Retrieves a category object corresponding to a BuiltInCategory id.
document: The document.
categoryId: A built in category id.
Returns: Returns a category object corresponding to a BuiltInCategory id.
Since:  2016

Autodesk.Revit.DB.Category.IsValid
Indicates if the Category is valid or not.
Remarks: A valid Category is one which is present in the Document's Categories.
Since: 2023.1

Autodesk.Revit.DB.Category
Represents the category or subcategory to which an element belongs.
Remarks: Categories are an important tool within Revit for identifying the inferred type of an
element, such as anything in the Walls category should be considered as a wall. The API
exposes access to the built in categories within Revit via the Document.Settings.Categories
property.